#include <iostream>
#include <cmath> 
#include <Windows.h>
#include <cstdlib>
#include <string>
#include <conio.h>
#include <cstring>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
using namespace std;

int m;
void victo() {
	int sc1 = 0;
	int menu = 0;
	char var;
	int os = 0;
	const int k = 10;
	int m[k];
	srand(time(NULL));
	for (int i = 0; i < k; i++)
	{
	a: m[i] = 1 + rand() % k;
		for (int j = 0; j < i; j++)
			if (m[j] == m[i]) goto a;

	}
	cout << "Меню\n\n1 - Начать играть\n2 - Правила\n3 - Настройки\n4 - Выход\n\nВыберите пункт меню - ";
	cin >> menu;
	if (menu == 1) {
		int i = 0;
		int b = 0;
		for (int j = 0; j < 10; j++) {
			b = m[i];
			i++;
			switch (b) {
			case 1:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Кто из президентов США написал свой собственный рассказ про Шерлока Холмса?\nА. Джон Кеннеди\nБ. Франклин Рузвельт\nВ. Рональд Рейган" << endl;
				cin >> var;
				if (var == 'Б')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 2:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Какую пошлину ввели в XII  веке в Англии для того чтобы заставить мужчин пойти на войну?\nА. Налог на тунеядство\nБ. Налог на трусость\nВ. Налог на отсутствие сапог" << endl;
				cin >> var;
				if (var == 'Б')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 3:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Откуда пошло выражение «деньги не пахнут?\nА. От подателей за провоз парфюмерии\nБ. От сборов за нестиранные носки\nВ. От налога на туалеты" << endl;
				cin >> var;
				if (var == 'В')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 4:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Туристы, приезжающие на Майорку, обязаны заплатить налог…\nА. На плавки\nБ. На пальмы.\nВ. На солнце" << endl;
				cin >> var;
				if (var == 'В')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 5:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Основой для «Сказки о рыбаке и рыбке Пушкина послужила сказка братьев Гримм «Рыбак и его жена».\nВ ней немецкая «коллега» нашей старухи превратилась в:\nА. Папу Римского\nБ. Королеву\nВ. Директора рыбзавода\nГ. Командира отряда водолазов" << endl;
				cin >> var;
				if (var == 'А')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 6:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Найдите ошибку в отрывке из басни Крылова: «Попрыгунья Стрекоза лето красное пропела; оглянуться не успела, как зима катит в глаза».\nА. Стрекозы не умеют прыгать\nБ. Эти насекомые совсем не издают звуков\nВ. Зимы в тех местах, о которых писал Крылов, нет\nГ. Здесь нет ошибки, все правильно" << endl;
				cin >> var;
				if (var == 'Б')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 7:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Российский мультфильм, удостоенный «Оскара», — это…\nА. «Простоквашино»\nБ. «Винни-Пух»\nВ. «Старик и море»\nГ. «Ну, погоди!»" << endl;
				cin >> var;
				if (var == 'В')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 8:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Кто из знаменитых художников за жизнь продал всего одну картину?\nА. Винсент Ван Гог.\nБ. Пьер Огюст Ренуар." << endl;
				cin >> var;
				if (var == 'А')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 9:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Один известный писатель рассказывал, что списал образ старушки-вредины со своей бывшей жены. При этом бабулька оказалась удивительно похожей на Коко Шанель.\nНа голове у нее всегда была шляпка со складной тульей, благодаря которой она и получила прозвище.\nА. Шапокляк\nБ. Красная Шапочка\nВ. Мадам Баттерфляй" << endl;
				cin >> var;
				if (var == 'А')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			case 10:
				system("cls");
				cout << "Колличество баллов " << sc1 << endl;
				cout << "Быки реагируют на красный цвет.\nA. Да\nБ. Нет" << endl;
				cin >> var;
				if (var == 'Б')
				{
					sc1 += 5;
				}
				else
				{
					sc1 += 3;
				}
				break;
			}
		}

	}
	else if (menu == 2) {
		cout << "Правила:\nОтвечайте на вопросы и получайте как можно больше баллов\nЗа правильный ответ +5 баллов, за не правильный +3 балла.";
	}
	else if (menu == 3) {
		cout << "ИХ НЕТ О_о";
	}
}

void game2() {
	setlocale(0, "");
	const int Q = 5;
	const char color = '1';
	int x, y, k, nump;
	char xo[Q][Q], c, z;
	string s, a, b, name1, name2;
	a = "нолик";
	b = "крестик";
	z = '0';
	c = 'X';
	cout << "Игра:" << endl;
	cout << "Введите имя первого игрока: ";
	cin >> name1;
	cout << "Введите имя второго игрока: ";
	cin >> name2;
	cout << "За кого ходит первый игрок?:" << endl;
	cout << "[1]-0" << endl;
	cout << "[2]-X" << endl;
	cout << "Цифра: ";
	cin >> nump;
	for (int i = 0; i < Q; i++)
	{
		for (int j = 0; j < Q; j++)
		{
			xo[i][j] = '-';
			cout << xo[i][j] << " ";
		}
		cout << endl;
	}
	for (int i = 0; i < 9; i++)
	{
		if ((!(i % 2)) && (nump == 1)) s = a;
		if ((!(i % 2)) && (nump == 2)) s = b;
		if ((i % 2) && (nump == 1)) s = b;
		if ((i % 2) && (nump == 2)) s = a;
	FSD:
		cout << "Сделайте ваш ход (" << s << ")" << endl;
		cout << "Строка: ";
		cin >> x;
		cout << "Столбец: ";
		cin >> y;
		x--;
		y--;
		if (xo[x][y] != '-')
		{
			system("cls");
			for (int i = 0; i < Q; i++)
			{
				for (int j = 0; j < Q; j++)
				{
					cout << xo[i][j] << " ";
				}
				cout << endl;
			}
			cout << "Данная позиция занята" << endl;
			goto FSD;
		}
		if ((!(i % 2)) && (nump == 1)) xo[x][y] = z;
		if ((!(i % 2)) && (nump == 2)) xo[x][y] = c;
		if ((i % 2) && (nump == 1)) xo[x][y] = c;
		if ((i % 2) && (nump == 2)) xo[x][y] = z;
		system("cls");
		k = 0;
		for (int i = 0; i < Q; i++)
		{
			for (int j = 0; j < Q; j++)
			{
				cout << xo[i][j] << " ";
			}
			cout << endl;
		}
		if (((xo[0][0] == '0') && (xo[0][1] == '0') && (xo[0][2] == '0') && (xo[0][3] == '0') && (xo[0][4] == '0')) ||
			((xo[1][0] == '0') && (xo[1][1] == '0') && (xo[1][2] == '0') && (xo[1][3] == '0') && (xo[1][4] == '0')) ||
			((xo[2][0] == '0') && (xo[2][1] == '0') && (xo[2][2] == '0') && (xo[2][3] == '0') && (xo[2][4] == '0')) ||
			((xo[3][0] == '0') && (xo[3][1] == '0') && (xo[3][2] == '0') && (xo[3][3] == '0') && (xo[3][4] == '0')) ||
			((xo[4][0] == '0') && (xo[4][1] == '0') && (xo[4][2] == '0') && (xo[4][3] == '0') && (xo[4][4] == '0')) ||
			((xo[0][0] == '0') && (xo[1][0] == '0') && (xo[2][0] == '0') && (xo[3][0] == '0') && (xo[4][0] == '0')) ||
			((xo[0][1] == '0') && (xo[1][1] == '0') && (xo[2][1] == '0') && (xo[3][1] == '0') && (xo[4][1] == '0')) ||
			((xo[0][2] == '0') && (xo[1][2] == '0') && (xo[2][2] == '0') && (xo[3][2] == '0') && (xo[4][2] == '0')) ||
			((xo[0][3] == '0') && (xo[1][3] == '0') && (xo[2][3] == '0') && (xo[3][3] == '0') && (xo[4][3] == '0')) ||
			((xo[0][4] == '0') && (xo[1][4] == '0') && (xo[2][4] == '0') && (xo[3][4] == '0') && (xo[4][4] == '0')) ||
			((xo[0][0] == '0') && (xo[1][1] == '0') && (xo[2][2] == '0') && (xo[3][3] == '0') && (xo[4][4] == '0')) ||
			((xo[4][0] == '0') && (xo[3][1] == '0') && (xo[2][2] == '0') && (xo[1][3] == '0') && (xo[0][4] == '0')) ||
			((xo[0][0] == 'X') && (xo[0][1] == 'X') && (xo[0][2] == 'X') && (xo[0][3] == 'X') && (xo[0][4] == 'X')) ||
			((xo[1][0] == 'X') && (xo[1][1] == 'X') && (xo[1][2] == 'X') && (xo[1][3] == 'X') && (xo[1][4] == 'X')) ||
			((xo[2][0] == 'X') && (xo[2][1] == 'X') && (xo[2][2] == 'X') && (xo[2][3] == 'X') && (xo[2][4] == 'X')) ||
			((xo[3][0] == 'X') && (xo[3][1] == 'X') && (xo[3][2] == 'X') && (xo[3][3] == 'X') && (xo[3][4] == 'X')) ||
			((xo[4][0] == 'X') && (xo[4][1] == 'X') && (xo[4][2] == 'X') && (xo[4][3] == 'X') && (xo[4][4] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][0] == 'X') && (xo[2][0] == 'X') && (xo[3][0] == 'X') && (xo[4][0] == 'X')) ||
			((xo[0][1] == 'X') && (xo[1][1] == 'X') && (xo[2][1] == 'X') && (xo[3][1] == 'X') && (xo[4][1] == 'X')) ||
			((xo[0][2] == 'X') && (xo[1][2] == 'X') && (xo[2][2] == 'X') && (xo[3][2] == 'X') && (xo[4][2] == 'X')) ||
			((xo[0][3] == 'X') && (xo[1][3] == 'X') && (xo[2][3] == 'X') && (xo[3][3] == 'X') && (xo[4][3] == 'X')) ||
			((xo[0][4] == 'X') && (xo[1][4] == 'X') && (xo[2][4] == 'X') && (xo[3][4] == 'X') && (xo[4][4] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][1] == 'X') && (xo[2][2] == 'X') && (xo[3][3] == 'X') && (xo[4][4] == 'X')) ||
			((xo[4][0] == 'X') && (xo[3][1] == 'X') && (xo[2][2] == 'X') && (xo[1][3] == 'X') && (xo[0][4] == 'X')))
		{
			k++;
			cout << "Игра закончена ";
			if ((xo[x][y] == z) && (nump == 1)) cout << name1 << " победиk" << endl;
			if ((xo[x][y] == c) && (nump == 2)) cout << name1 << " победил" << endl;
			if ((xo[x][y] == c) && (nump == 1)) cout << name2 << " победил" << endl;
			if ((xo[x][y] == z) && (nump == 2)) cout << name2 << " победил" << endl;
			break;
		}
	}
	if (!(k)) cout << "ничья" << endl;
	system("pause");
}

void game1() {
	setlocale(0, "");
	const int P = 4;
	const char color = '1';
	int x, y, k, nump;
	char xo[P][P], c, z;
	string s, a, b, name1, name2;
	a = "нолик";
	b = "крестик";
	z = '0';
	c = 'X';
	cout << "Игра:" << endl;
	cout << "Введите имя первого игрока: ";
	cin >> name1;
	cout << "Введите имя второго игрока: ";
	cin >> name2;
	cout << "За кого ходит первый игрок?:" << endl;
	cout << "[1]-0" << endl;
	cout << "[2]-X" << endl;
	cout << "Цифра: ";
	cin >> nump;
	for (int i = 0; i < P; i++)
	{
		for (int j = 0; j < P; j++)
		{
			xo[i][j] = '-';
			cout << xo[i][j] << " ";
		}
		cout << endl;
	}
	for (int i = 0; i < 9; i++)
	{
		if ((!(i % 2)) && (nump == 1)) s = a;
		if ((!(i % 2)) && (nump == 2)) s = b;
		if ((i % 2) && (nump == 1)) s = b;
		if ((i % 2) && (nump == 2)) s = a;
	FSD:
		cout << "Сделайте ваш ход (" << s << ")" << endl;
		cout << "Строка: ";
		cin >> x;
		cout << "Столбец: ";
		cin >> y;
		x--;
		y--;
		if (xo[x][y] != '-')
		{
			system("cls");
			for (int i = 0; i < P; i++)
			{
				for (int j = 0; j < P; j++)
				{
					cout << xo[i][j] << " ";
				}
				cout << endl;
			}
			cout << "Данная позиция занята" << endl;
			goto FSD;
		}
		if ((!(i % 2)) && (nump == 1)) xo[x][y] = z;
		if ((!(i % 2)) && (nump == 2)) xo[x][y] = c;
		if ((i % 2) && (nump == 1)) xo[x][y] = c;
		if ((i % 2) && (nump == 2)) xo[x][y] = z;
		system("cls");
		k = 0;
		for (int i = 0; i < P; i++)
		{
			for (int j = 0; j < P; j++)
			{
				cout << xo[i][j] << " ";
			}
			cout << endl;
		}
		if (((xo[0][0] == '0') && (xo[0][1] == '0') && (xo[0][2] == '0') && (xo[0][3] == '0')) ||
			((xo[1][0] == '0') && (xo[1][1] == '0') && (xo[1][2] == '0') && (xo[1][3] == '0')) ||
			((xo[2][0] == '0') && (xo[2][1] == '0') && (xo[2][2] == '0') && (xo[2][3] == '0')) ||
			((xo[3][0] == '0') && (xo[3][1] == '0') && (xo[3][2] == '0') && (xo[3][3] == '0')) ||
			((xo[0][0] == '0') && (xo[1][0] == '0') && (xo[2][0] == '0') && (xo[3][0] == '0')) ||
			((xo[0][1] == '0') && (xo[1][1] == '0') && (xo[2][1] == '0') && (xo[3][1] == '0')) ||
			((xo[0][2] == '0') && (xo[1][2] == '0') && (xo[2][2] == '0') && (xo[3][2] == '0')) ||
			((xo[0][3] == '0') && (xo[1][3] == '0') && (xo[2][3] == '0') && (xo[3][3] == '0')) ||
			((xo[0][0] == '0') && (xo[1][1] == '0') && (xo[2][2] == '0') && (xo[3][3] == '0')) ||
			((xo[3][0] == '0') && (xo[2][1] == '0') && (xo[1][2] == '0') && (xo[0][3] == '0')) ||
			((xo[0][0] == 'X') && (xo[0][1] == 'X') && (xo[0][2] == 'X') && (xo[0][3] == 'X')) ||
			((xo[1][0] == 'X') && (xo[1][1] == 'X') && (xo[1][2] == 'X') && (xo[1][3] == 'X')) ||
			((xo[2][0] == 'X') && (xo[2][1] == 'X') && (xo[2][2] == 'X') && (xo[2][3] == 'X')) ||
			((xo[3][0] == 'X') && (xo[3][1] == 'X') && (xo[3][2] == 'X') && (xo[3][3] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][0] == 'X') && (xo[2][0] == 'X') && (xo[3][0] == 'X')) ||
			((xo[0][1] == 'X') && (xo[1][1] == 'X') && (xo[2][1] == 'X') && (xo[3][1] == 'X')) ||
			((xo[0][2] == 'X') && (xo[1][2] == 'X') && (xo[2][2] == 'X') && (xo[3][2] == 'X')) ||
			((xo[0][3] == 'X') && (xo[1][3] == 'X') && (xo[2][3] == 'X') && (xo[3][3] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][1] == 'X') && (xo[2][2] == 'X') && (xo[3][3] == 'X')) ||
			((xo[3][0] == 'X') && (xo[2][1] == 'X') && (xo[1][2] == 'X') && (xo[0][3] == 'X')))
		{
			k++;
			cout << "Игра закончена ";
			if ((xo[x][y] == z) && (nump == 1)) cout << name1 << " победиk" << endl;
			if ((xo[x][y] == c) && (nump == 2)) cout << name1 << " победил" << endl;
			if ((xo[x][y] == c) && (nump == 1)) cout << name2 << " победил" << endl;
			if ((xo[x][y] == z) && (nump == 2)) cout << name2 << " победил" << endl;
			break;
		}
	}
	if (!(k)) cout << "ничья" << endl;
	system("pause");
}
void game() {
	setlocale(0, "");
	const int N = 3;
	const char color = '1';
	int x, y, k, nump;
	char xo[N][N], c, z;
	string s, a, b, name1, name2;
	a = "нолик";
	b = "крестик";
	z = '0';
	c = 'X';
	cout << "Игра:" << endl;
	cout << "Введите имя первого игрока: ";
	cin >> name1;
	cout << "Введите имя второго игрока: ";
	cin >> name2;
	cout << "За кого ходит первый игрок?:" << endl;
	cout << "[1]-0" << endl;
	cout << "[2]-X" << endl;
	cout << "Цифра: ";
	cin >> nump;
	for (int i = 0; i < N; i++)
	{
		for (int j = 0; j < N; j++)
		{
			xo[i][j] = '-';
			cout << xo[i][j] << " ";
		}
		cout << endl;
	}
	for (int i = 0; i < 9; i++)
	{
		if ((!(i % 2)) && (nump == 1)) s = a;
		if ((!(i % 2)) && (nump == 2)) s = b;
		if ((i % 2) && (nump == 1)) s = b;
		if ((i % 2) && (nump == 2)) s = a;
	FSD:
		cout << "Сделайте ваш ход (" << s << ")" << endl;
		cout << "Строка: ";
		cin >> x;
		cout << "Столбец: ";
		cin >> y;
		x--;
		y--;
		if (xo[x][y] != '-')
		{
			system("cls");
			for (int i = 0; i < N; i++)
			{
				for (int j = 0; j < N; j++)
				{
					cout << xo[i][j] << " ";
				}
				cout << endl;
			}
			cout << "Данная позиция занята" << endl;
			goto FSD;
		}
		if ((!(i % 2)) && (nump == 1)) xo[x][y] = z;
		if ((!(i % 2)) && (nump == 2)) xo[x][y] = c;
		if ((i % 2) && (nump == 1)) xo[x][y] = c;
		if ((i % 2) && (nump == 2)) xo[x][y] = z;
		system("cls");
		k = 0;
		for (int i = 0; i < N; i++)
		{
			for (int j = 0; j < N; j++)
			{
				cout << xo[i][j] << " ";
			}
			cout << endl;
		}
		if (((xo[0][0] == '0') && (xo[0][1] == '0') && (xo[0][2] == '0')) ||
			((xo[1][0] == '0') && (xo[1][1] == '0') && (xo[1][2] == '0')) ||
			((xo[2][0] == '0') && (xo[2][1] == '0') && (xo[2][2] == '0')) ||
			((xo[0][0] == '0') && (xo[1][0] == '0') && (xo[2][0] == '0')) ||
			((xo[0][1] == '0') && (xo[1][1] == '0') && (xo[2][1] == '0')) ||
			((xo[0][2] == '0') && (xo[1][2] == '0') && (xo[2][2] == '0')) ||
			((xo[0][0] == '0') && (xo[1][1] == '0') && (xo[2][2] == '0')) ||
			((xo[2][0] == '0') && (xo[1][1] == '0') && (xo[0][2] == '0')) ||
			((xo[0][0] == 'X') && (xo[0][1] == 'X') && (xo[0][2] == 'X')) ||
			((xo[1][0] == 'X') && (xo[1][1] == 'X') && (xo[1][2] == 'X')) ||
			((xo[2][0] == 'X') && (xo[2][1] == 'X') && (xo[2][2] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][0] == 'X') && (xo[2][0] == 'X')) ||
			((xo[0][1] == 'X') && (xo[1][1] == 'X') && (xo[2][1] == 'X')) ||
			((xo[0][2] == 'X') && (xo[1][2] == 'X') && (xo[2][2] == 'X')) ||
			((xo[0][0] == 'X') && (xo[1][1] == 'X') && (xo[2][2] == 'X')) ||
			((xo[2][0] == 'X') && (xo[1][1] == 'X') && (xo[0][2] == 'X')))
		{
			k++;
			cout << "Игра закончена ";
			if ((xo[x][y] == z) && (nump == 1)) cout << name1 << " победиk" << endl;
			if ((xo[x][y] == c) && (nump == 2)) cout << name1 << " победил" << endl;
			if ((xo[x][y] == c) && (nump == 1)) cout << name2 << " победил" << endl;
			if ((xo[x][y] == z) && (nump == 2)) cout << name2 << " победил" << endl;
			break;
		}
	}
	if (!(k)) cout << "ничья" << endl;
	system("pause");
}
int menuXO() {
	int diff = 1;
	while (true)
	{
		system("cls");
		int menu;
		cout << "Меню\n\n1 - Начать играть\n2 - Правила\n3 - Настройки\n4 - Выход\n\nВыберите пункт меню - ";
		cin >> menu;
		if (menu == 1) {
			system("cls");
			if (diff == 1) {
				game();
			}
			else if (diff == 2) {
				game1();
			}
			else if (diff == 3) {
				game2();
			}
		}
		else if (menu == 2) {
			system("cls");
			int a;
			cout << "\nПравила:\nСначала выбираете себе имя, потом выбераете за кого ходит 1 игрок.\nВыигрывает тот кто собирёт 3 в ряд(Х или О), по диагонали, горизонтали, вертикали\n\n1. Выход\n";
			cin >> a;
			system("cls");
		}
		else if (menu == 3) {
		backmenu:
			system("cls");
			cout << "1 - Настройка цвета\n2 - Сложность игры\n3 - Выход";
			cin >> m;
			if (m == 1) {
			backmenu1:
				system("cls");
				int e;
				cout << "1 - Цвет фона и текста\n2 - Назад";
				cin >> e;
				if (e == 1) {
					system("cls");
					int menu1;
					cout << "Выберите цвет: \n1. Черный - белый\n2. Синий - зеленый\n3. Красный - желтый\n4. Белый - черный\n5. Черный - зеленый\n6. Назад";
					cin >> menu1; 
					if (menu1 == 1) {
						system("color 0F");
					}
					else if (menu1 == 2) {
						system("color 12");
					}
					else if (menu1 == 3) {
						system("color E4");
					}
					else if (menu1 == 4) {
						system("color F0");
					}
					else if (menu1 == 5) {
						system("color 02");
					}
					else if (menu1 == 6) {
						system("cls");
						goto backmenu1;
					}
				}
				else if (e == 2) {
					system("cls");
					goto backmenu;
				}
			}
			else if (m == 2) {
				int menu = 0;
				system("cls");
				cout << "1. 3X3\n2. 4x4\n3. 5x5\n";
				cin >> menu;
				if (menu == 1) {
					diff = 1;
				}
				else if (menu == 2) {
					diff = 2;
				}
				else if (menu == 3) {
					diff = 3;
				}
			}
			else if (m == 3) {
				system("cls");
			}
		}
		else if (menu == 4) {
			system("taskkill /f /IM VsDebugConsole.exe");
		}
	}
	return menuXO();
}
int main()
{
	setlocale(0, "");
	int menu;
	cout << "[-] Меню\n[1] Крестики - нолики\n[2] Викторина";
	cout << endl << "Выберите пункт меню  - ";
	cin >> menu;
	system("cls");
	if (menu == 1) {
		menuXO();
	}
	else if (menu == 2) {
		victo();
	}
	return 0;
}
